/*定义各种常量*/

const DEAL_STATE = {
  1:"待录入",
  2:"已录入",
  3:"医生已确认",
  4:"患者已确认",
  5:"已支付",
  6:"配药完成",
  7:"打包完成",
  8:"已发货",
  9:"已签收",
  10:"已自提",
  11:"交易结束",
  12:"退款中",
  13:"交易取消",
  14:"已到店",
  15:"已爽约",
  16:" 待支付",
  17:" 预约成功",
  18:" 已取消",
  19:"退款成功",
  20:"已退号",
  21:" 挂号单已生成",
  22:" 挂号单已支付",
  23:" 已取号",
  24:" 应诊",
  25:" 已就诊",
  26:" 已取消",
  27:" 已退号",
  28:" 退号中",
  29:" 已爽约",
  30:" 待支付",
  31:" 待发货",
  32:" 已发货，待签收",
  33:" 已签收，交易成功",
  34:" 已取消",
  40:"咨询待支付",
  41:"咨询已支付",
  42:"咨询单取消",
  43:"咨询正发起退款",
  44:"咨询订单已退款",
}


const payTypeMap = ["未选择支付方式", "到店支付", "支付宝支付", "微信支付"];


const BUESSINESS = {
  decoctItemCode: "060600100001", //代煎费        decoctItemCode2: "060600100002",
  bagItemCode_L: "040100100024",  //塑料手提袋大号
  bagItemCode_M: "040100100022",  //塑料手提袋中号
  bagItemCode_S: "040100100023",  //塑料手提袋小号
};

//处方项目类型
const RECIPE_TYPE = {
  1:"中药饮片",
  2:"颗粒剂",
  3:"协定方",
  4:"中西成药",
  5:"西药",
  6:"检查",
  7:"化验",
  8:"治疗",
  9:"材料",
  10:"其他",
  11:"协定方制作"
};

module.exports = {
  DEAL_STATE,
  BUESSINESS,
  payTypeMap,
  RECIPE_TYPE
}
